<template>
  <v-container fluid id="graph-container" class="content-container">
    <v-row class="px-6 pt-6">
      <v-col>
        <p class="text-h3">关于本项目</p>
      </v-col>
    </v-row>
    <v-row>
      <v-col>
        <v-card class="pa-6" outlined raised>
          <v-row align="baseline">
            <v-col cols="9" class="flex-grow-1">
              <p class="text-h4">基于漏洞知识图谱的可视化系统</p>
            </v-col>
            <v-col class="justify-end">
              <p class="text-h6 text-end">作者：Ridd</p>
            </v-col>
          </v-row>
          <v-row>
            <v-col class="text-body-1">
              <p class="text-h5">研究背景及意义</p>
              <p>
                近年来，随着互联网产业迅速发展，互联网安全漏洞问题的显著性也急剧增加。公共漏洞和暴露
                (Common Vulnerabilities and Exposures, CVE)
                等权威漏洞数据档案库的数据显示，自 1999
                年该漏洞库库首次披露安全漏洞以来，互联网安全漏洞年新增数量呈增长趋势。2019
                年全年，新增漏洞两万余个；2020 年全年新增漏洞三万五千余个。
                随着现代软件系统复杂度提升、互联网加速漏洞信息传播，对攻击者而言，不仅漏洞攻击的学习成本和实施难度下降，其可以利用的漏洞数量也明显增多；对企业与开发者而言，随着开源化逐渐成为一种潮流趋势，各类计算机软硬件与互联网产品对开源项目的依赖性随之提高。正如近期
                Java Log4j
                日志组件漏洞造成全球互联网范围的大规模信息安全问题，计算机与互联网产业蓬勃发展的同时，也面临与日俱增的信息安全挑战。
              </p>
              <p>
                本课题针对上述问题，提出一种漏洞知识图谱可视化系统。基于爬虫抽取、知识图谱、图数据库、可视化前端等技术，对多种数据源的互联网公开漏洞数据，包括漏洞描述及风险评估、受影响资产、可利用代码及补丁等信息进行收集与分析，通过对异构数据源抽取的数据进行实体构建、关系构建、关系融合等处理，在图数据库中建立漏洞本体信息及其之间的关联信息，从而形成具有一定知识结构的知识图谱。基于该漏洞知识图谱，搭建基于
                B/S 架构的可视化系统，提供易于使用的接口、用户友好的 UI
                界面呈现漏洞知识图谱信息、进行创建统计图表、知识筛选等操作。本系统采用自动化的方式，实现对漏洞信息的持续收集与整理，极大节省了人力资源的消耗。结合抽取关键信息建立互联网信息安全本体、对漏洞间关联性进行分析、构建漏洞知识图谱，将分散的漏洞信息转化为相互联系的图结构，本系统将为开发者提供项目依赖安全性参考、为计算机信息安全研究人员提供逻辑清晰、直观易于理解的统计数据与服务支撑。
                本系统作为自由软件发布，使用 GPLv3
                协议授权，自由与开放促进构建更高 效安全的互联网环境。
              </p>
              <p class="text-h5">前端界面介绍</p>
              <p>
                视图包含控制台、可视化、搜索、关于四部分。<br />
                控制台视图为用户提供知识图谱信息概览，包含列表形式的数据展现，以及统计图表形式的数据可视化。<br />
                可视化视图是一个全屏视图，通过该视图用户可以一览知识图谱全貌。<br />
                搜索视图支持用户在图谱中搜索感兴趣的内容，并将搜索结果以力引导图可视化的形式展示。<br />
                关于视图展示本系统相关信息及用户指南。
              </p>
            </v-col>
          </v-row>
        </v-card>
      </v-col>
    </v-row>
  </v-container>
</template>
<style src="../styles/base.css" scoped></style>
<style scoped>
</style>
